diplom-src/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>ВКМ_СписокСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ВидРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

diplom-src/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ВидРасчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

diplom-src/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
//НачалоДоработки. Барышникова Ю.А ,14.11.2024 
//Начисление премии

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	#Область ОбработчикиСобытий

	Процедура ОбработкаПроведения(Отказ, Режим)

		//Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;

		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;  
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить(); 

		СформироватьДвиженияДопНачисления();   
		СформироватьДвиженияУдержания();

		РассчитатьНФДЛ();

	КонецПроцедуры

	#КонецОбласти

	#Область СлужебныеПроцедурыИФункции

	Процедура СформироватьДвиженияДопНачисления()

		Для Каждого Строка Из ВКМ_СписокСотрудников Цикл  

			// регистр ВКМ_ДополнительныеНачисления
			Движение  = Движения.ВКМ_ДополнительныеНачисления.Добавить(); 
			Движение.ПериодРегистрации = Дата; 
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия;
			Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
			Движение.ВКМ_Сумма = Строка.ВКМ_СуммаПремии;    

			 //регистр ВКМ_ВзаиморасчетыССотрудниками Приход
			ДвижениеВз = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВз.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижениеВз.Период = Дата;
			ДвижениеВз.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
			ДвижениеВз.ВКМ_Сумма = Строка.ВКМ_СуммаПремии;   

		КонецЦикла;

		Движения.ВКМ_ДополнительныеНачисления.Записать();

КонецПроцедуры 

	Процедура СформироватьДвиженияУдержания()

		Для Каждого Строка Из ВКМ_СписокСотрудников Цикл   

			// регистр ВКМ_Удержания	
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
			Движение.ВКМ_Сотрудник = Строка.ВКМ_Сотрудник;
			Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
			Движение.БазовыйПериодКонец = КонецМесяца(Дата);  

		КонецЦикла;

		Движения.ВКМ_Удержания.Записать();

КонецПроцедуры 

Процедура РассчитатьНФДЛ()

		Запрос = Новый Запрос;
		Запрос.Текст = 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_Удержания.НомерСтроки КАК НомерСтроки,
		|	ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НачисленоБаза, 0) КАК НачисленоБаза,
		|	ВКМ_Удержания.БазовыйПериодКонец КАК БазовыйПериодКонец,
		|	ВКМ_Удержания.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало1,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец1,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез КАК РегистраторРазрез
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
		|				&Измерения,
		|				&Измерения,
		|				&Разрезы,
		|				Регистратор = &Ссылка
		|					И ВидРасчета = &Удержание) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
		|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|	И ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РегистраторРазрез = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Регистратор";



		Запрос.УстановитьПараметр("Ссылка", Ссылка);   
		Запрос.УстановитьПараметр("Удержание",  ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ);  

		Измерения = Новый Массив;
		Измерения.Добавить("Сотрудник");

		Разрезы = Новый Массив;
		Разрезы.Добавить("Регистратор");

		Запрос.УстановитьПараметр("Измерения", Измерения); 
		Запрос.УстановитьПараметр("Разрезы", Разрезы);  

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл

			// регистр ВКМ_ДополнительныеНачисления
			ДвижениеУдержание = Движения.ВКМ_Удержания[Выборка.НомерСтроки-1];   
			ДвижениеУдержание.ВКМ_НДФЛ = Выборка.НачисленоБаза/100*13; 
			Движения.ВКМ_Удержания.Записать(, Истина);

			// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
			ДвижениеВз = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			ДвижениеВз.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеВз.Период = Дата;
			ДвижениеВз.ВКМ_Сотрудник = Выборка.Сотрудник;
			ДвижениеВз.ВКМ_Сумма = ДвижениеУдержание.ВКМ_НДФЛ;   

		КонецЦикла;  

	КонецПроцедуры





	
	#КонецОбласти

#КонецЕсли

//Конец доработки
